---
kind: property
id: P:Autodesk.Revit.DB.ConicalFace.Radius(System.Int32)
source: html/d10429e0-9e0c-16fe-7809-97a844691c35.htm
---
# Autodesk.Revit.DB.ConicalFace.Radius Property

Radii of the surface.

## Syntax (C#)
```csharp
public XYZ this[
	int index
] { get; }
```

## Parameters
- **index** (`System.Int32`)